<a href="https://colab.research.google.com/github/Charlotte-01/Employee_Retention/blob/master/Employee_retention.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Connect to Google Drive**

In [11]:
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [12]:
ls -ahl 'gdrive/My Drive/A collection of Data Science take-home challenge/Employee Retention'

total 1.3M
-rw------- 1 root root 1.3M Jan  7  2019 employee_retention_data.csv

In [13]:
# import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

## **Data Explore**

In [15]:
# Load Data
df = pd.read_csv('gdrive/My Drive/A collection of Data Science take-home challenge/Employee Retention/employee_retention_data.csv')
df.head()

   employee_id  company_id              dept  ...    salary   join_date   quit_date
0      13021.0           7  customer_service  ...   89000.0  2014-03-24  2015-10-30
1     825355.0           7         marketing  ...  183000.0  2013-04-29  2014-04-04
2     927315.0           4         marketing  ...  101000.0  2014-10-13         NaN
3     662910.0           7  customer_service  ...  115000.0  2012-05-14  2013-06-07
4     256971.0           2      data_science  ...  276000.0  2011-10-17  2014-08-22

[5 rows x 7 columns]

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24702 entries, 0 to 24701
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  24702 non-null  float64
 1   company_id   24702 non-null  int64
 2   dept         24702 non-null  object
 3   seniority    24702 non-null  int64
 4   salary       24702 non-null  float64
 5   join_date    24702 non-null  object
 6   quit_date    13510 non-null  object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.3+ MB

In [28]:
df.describe()

         employee_id    company_id     seniority         salary
count   24702.000000  24702.000000  24702.000000   24702.000000
mean   501604.403530      3.426969     14.127803  138183.345478
std    288909.026101      2.700011      8.089520   76058.184573
min        36.000000      1.000000      1.000000   17000.000000
25%    250133.750000      1.000000      7.000000   79000.000000
50%    500793.000000      2.000000     14.000000  123000.000000
75%    753137.250000      5.000000     21.000000  187000.000000
max    999969.000000     12.000000     99.000000  408000.000000

In [29]:
# average salary and seniority in each department.
df.groupby('dept')[['seniority','salary']].mean()

                  seniority         salary
dept
customer_service  14.171133   82245.424837
data_science      14.189028  206885.893417
design            14.197826  137460.869565
engineer          14.172122  205544.548016
marketing         13.993685  135598.042311
sales             13.979823  135912.358134

#### Notice:
The average salary of data and engineer departments are much higher than other departments.

In [35]:
# drop the employee still in the company
df_l = df.dropna(subset=['quit_date'])
df_l.head()

   employee_id  company_id              dept  ...    salary   join_date   quit_date
0      13021.0           7  customer_service  ...   89000.0  2014-03-24  2015-10-30
1     825355.0           7         marketing  ...  183000.0  2013-04-29  2014-04-04
3     662910.0           7  customer_service  ...  115000.0  2012-05-14  2013-06-07
4     256971.0           2      data_science  ...  276000.0  2011-10-17  2014-08-22
5     509529.0           4      data_science  ...  165000.0  2012-01-30  2013-08-30

[5 rows x 7 columns]

In [44]:
# Check totall NA in the datasets
df.isnull().sum()
#df_a = df.fillna(df['quit_date'] =='2015-12-13')
#df_a.head()

employee_id        0
company_id         0
dept               0
seniority          0
salary             0
join_date          0
quit_date      11192
dtype: int64

In [45]:
# fill the last_day as 2015/12/13 for current employee, since na only in the quit_date
df_a = df.fillna('2015-12-13')
df_a.head()

   employee_id  company_id              dept  ...    salary   join_date   quit_date
0      13021.0           7  customer_service  ...   89000.0  2014-03-24  2015-10-30
1     825355.0           7         marketing  ...  183000.0  2013-04-29  2014-04-04
2     927315.0           4         marketing  ...  101000.0  2014-10-13  2015-12-13
3     662910.0           7  customer_service  ...  115000.0  2012-05-14  2013-06-07
4     256971.0           2      data_science  ...  276000.0  2011-10-17  2014-08-22

[5 rows x 7 columns]

## **Create a table with 3 columns: day, employee_headcount, company_id.**

In [39]:
# Create list
Day_list = pd.date_range(start='2011-01-24', end='2015-12-13', freq='D')
Company_list = sorted(df['company_id'].unique())

day =[]
employee_headcount=[]
company_id =[]

for i in

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

What are the main factors that drive employee churn? Do they make sense? Explain your findings.

If you could add to this data set just one variable that could help explain employee churn, what would that be?